test/request-response-samples/readMetadata__should_respect_xsi_type_attribute/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://soap.sforce.com/2006/04/metadata"><soap:Body><tns:readMetadata xmlns:tns="http://soap.sforce.com/2006/04/metadata" xmlns="http://soap.sforce.com/2006/04/metadata"><tns:type>CustomObject</tns:type><tns:fullNames>Opportunity</tns:fullNames></tns:readMetadata></soap:Body></soap:Envelope>