test/request-response-samples/readMetadata__should_respect_xsi_type_attribute/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header/><soap:Body><ns1:readMetadata xmlns:ns1="http://soap.sforce.com/2006/04/metadata"><ns1:type>CustomObject</ns1:type><ns1:fullNames>Opportunity</ns1:fullNames></ns1:readMetadata></soap:Body></soap:Envelope>